OpenNuvoton/NuTool-PinConfigure/Header/M2003C/sys.h
/* PF.2 MFP */
#define SYS_GPF_MFPL_PF2MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for GPIO              */
#define SYS_GPF_MFPL_PF2MFP_UART0_RXD       (0x3UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for UART0_RXD         */
#define SYS_GPF_MFPL_PF2MFP_I2C0_SDA        (0x4UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for I2C0_SDA          */
#define SYS_GPF_MFPL_PF2MFP_SPI0_CLK        (0x5UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for SPI0_CLK          */
#define SYS_GPF_MFPL_PF2MFP_XT1_OUT         (0xAUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for XT1_OUT           */
#define SYS_GPF_MFPL_PF2MFP_BPWM0_CH1       (0xBUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for BPWM0_CH1         */

/* PF.3 MFP */
#define SYS_GPF_MFPL_PF3MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for GPIO              */
#define SYS_GPF_MFPL_PF3MFP_UART0_TXD       (0x3UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for UART0_TXD         */
#define SYS_GPF_MFPL_PF3MFP_I2C0_SCL        (0x4UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for I2C0_SCL          */
#define SYS_GPF_MFPL_PF3MFP_XT1_IN          (0xAUL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for XT1_IN            */
#define SYS_GPF_MFPL_PF3MFP_BPWM0_CH0       (0xBUL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for BPWM0_CH0         */

/* PF.4 MFP */
#define SYS_GPF_MFPL_PF4MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for GPIO              */
#define SYS_GPF_MFPL_PF4MFP_PWM0_CH1        (0x7UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for PWM0_CH1          */
#define SYS_GPF_MFPL_PF4MFP_BPWM0_CH5       (0x8UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for BPWM0_CH5         */
#define SYS_GPF_MFPL_PF4MFP_X32_OUT         (0xAUL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for X32_OUT           */

/* PF.5 MFP */
#define SYS_GPF_MFPL_PF5MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for GPIO              */
#define SYS_GPF_MFPL_PF5MFP_PWM0_CH0        (0x7UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for PWM0_CH0          */
#define SYS_GPF_MFPL_PF5MFP_BPWM0_CH4       (0x8UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for BPWM0_CH4         */
#define SYS_GPF_MFPL_PF5MFP_X32_IN          (0xAUL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for X32_IN            */
#define SYS_GPF_MFPL_PF5MFP_ADC0_ST         (0xBUL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for ADC0_ST           */

/* PF.6 MFP */
#define SYS_GPF_MFPL_PF6MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for GPIO              */
#define SYS_GPF_MFPL_PF6MFP_SPI1_MOSI       (0x5UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SPI1_MOSI         */
#define SYS_GPF_MFPL_PF6MFP_TAMPER0         (0xAUL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for TAMPER0           */

/* PF.14 MFP */
#define SYS_GPF_MFPH_PF14MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for GPIO             */
#define SYS_GPF_MFPH_PF14MFP_PWM0_BRAKE0    (0xAUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for PWM0_BRAKE0      */
#define SYS_GPF_MFPH_PF14MFP_PWM0_CH4       (0xCUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for PWM0_CH4         */
#define SYS_GPF_MFPH_PF14MFP_CLKO           (0xDUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for CLKO             */
#define SYS_GPF_MFPH_PF14MFP_TM3            (0xEUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for TM3              */
#define SYS_GPF_MFPH_PF14MFP_INT5           (0xFUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for INT5             */

/* PF.15 MFP */
#define SYS_GPF_MFPH_PF15MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for GPIO             */
#define SYS_GPF_MFPH_PF15MFP_PWM0_BRAKE0    (0xBUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for PWM0_BRAKE0      */
#define SYS_GPF_MFPH_PF15MFP_PWM0_CH1       (0xCUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for PWM0_CH1         */
#define SYS_GPF_MFPH_PF15MFP_TM2            (0xDUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for TM2              */
#define SYS_GPF_MFPH_PF15MFP_CLKO           (0xEUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for CLKO             */
#define SYS_GPF_MFPH_PF15MFP_INT4           (0xFUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for INT4             */

/* PJ.0 MFP */
#define SYS_GPJ_MFPL_PJ0MFP_GPIO            (0x0UL<<SYS_GPJ_MFPL_PJ0MFP_Pos)    /*!< GPJ_MFPL PJ0 setting for GPIO              */
#define SYS_GPJ_MFPL_PJ0MFP_UART0_TXD       (0x7UL<<SYS_GPJ_MFPL_PJ0MFP_Pos)    /*!< GPJ_MFPL PJ0 setting for UART0_TXD         */
#define SYS_GPJ_MFPL_PJ0MFP_CAN0_TXD        (0xAUL<<SYS_GPJ_MFPL_PJ0MFP_Pos)    /*!< GPJ_MFPL PJ0 setting for CAN0_TXD          */
#define SYS_GPJ_MFPL_PJ0MFP_PWM0_CH4        (0xCUL<<SYS_GPJ_MFPL_PJ0MFP_Pos)    /*!< GPJ_MFPL PJ0 setting for PWM0_CH4          */

/* PJ.1 MFP */
#define SYS_GPJ_MFPL_PJ1MFP_GPIO            (0x0UL<<SYS_GPJ_MFPL_PJ1MFP_Pos)    /*!< GPJ_MFPL PJ1 setting for GPIO              */
#define SYS_GPJ_MFPL_PJ1MFP_UART0_RXD       (0x7UL<<SYS_GPJ_MFPL_PJ1MFP_Pos)    /*!< GPJ_MFPL PJ1 setting for UART0_RXD         */
#define SYS_GPJ_MFPL_PJ1MFP_CAN0_RXD        (0xAUL<<SYS_GPJ_MFPL_PJ1MFP_Pos)    /*!< GPJ_MFPL PJ1 setting for CAN0_RXD          */
#define SYS_GPJ_MFPL_PJ1MFP_PWM0_CH5        (0xCUL<<SYS_GPJ_MFPL_PJ1MFP_Pos)    /*!< GPJ_MFPL PJ1 setting for PWM0_CH5          */

/* PJ.10 MFP */
#define SYS_GPJ_MFPH_PJ10MFP_GPIO           (0x0UL<<SYS_GPJ_MFPH_PJ10MFP_Pos)   /*!< GPJ_MFPH PJ10 setting for GPIO             */
#define SYS_GPJ_MFPH_PJ10MFP_UART1_TXD      (0x6UL<<SYS_GPJ_MFPH_PJ10MFP_Pos)   /*!< GPJ_MFPH PJ10 setting for UART1_TXD        */
#define SYS_GPJ_MFPH_PJ10MFP_I2C1_SCL       (0x8UL<<SYS_GPJ_MFPH_PJ10MFP_Pos)   /*!< GPJ_MFPH PJ10 setting for I2C1_SCL         */
#define SYS_GPJ_MFPH_PJ10MFP_CAN0_TXD       (0xBUL<<SYS_GPJ_MFPH_PJ10MFP_Pos)   /*!< GPJ_MFPH PJ10 setting for CAN0_TXD         */
#define SYS_GPJ_MFPH_PJ10MFP_PWM0_CH3       (0xCUL<<SYS_GPJ_MFPH_PJ10MFP_Pos)   /*!< GPJ_MFPH PJ10 setting for PWM0_CH3         */

